<template>
    <div class="page">
        <HeaderBar />
        <main class="content">
            <section class="about-us-page">
                <div class="page page-1">
                    <img src="/Image/00_Main Image/young-woman-lying-bed.webp" alt="">
                    <div class="page-main">
                        <img src="/Logo&Icon/Logo/Logo_green.webp" alt="">
                        <p>Thailand's First Adult Platform</p>
                    </div>
                </div>
                <div class="page page-2">
                    <div class="card">
                        <h1>TAIKIP แพลตฟอร์มวิดีโอสำหรับคนรุ่นใหม่</h1>

                        <p class="">TAIKIP คือ แพลตฟอร์มวิดีโอแห่งใหม่ สำหรับคนรุ่นใหม่ที่อยากสร้างรายได้จากการถ่ายคลิปและแสดงตัวตนในแบบของคุณ ไม่ว่าคุณจะเป็นคนดัง คอนเทนต์ครีเอเตอร์ หรือคนธรรมดาที่มีความฝัน ที่นี่คือพื้นที่ให้คุณ “แจ้งเกิด” ได้จริง เพียงแค่อัปโหลดคลิปวิดีโอสุดสร้างสรรค์ของคุณ TAIKIP จะช่วยให้คุณได้ทำในสิ่งที่รักพร้อมกับสร้างรายได้ออนไลน์ไปพร้อมกัน</p>
                    </div>
                    <div class="card">
                        <h1>TAIKIP แพลตฟอร์มวิดีโอสำหรับคนรุ่นใหม่</h1>

                        <p class="bg-light-200">TAIKIP คือ แพลตฟอร์มวิดีโอแห่งใหม่ สำหรับคนรุ่นใหม่ที่อยากสร้างรายได้จากการถ่ายคลิปและแสดงตัวตนในแบบของคุณ ไม่ว่าคุณจะเป็นคนดัง คอนเทนต์ครีเอเตอร์ หรือคนธรรมดาที่มีความฝัน ที่นี่คือพื้นที่ให้คุณ “แจ้งเกิด” ได้จริง เพียงแค่อัปโหลดคลิปวิดีโอสุดสร้างสรรค์ของคุณ TAIKIP จะช่วยให้คุณได้ทำในสิ่งที่รักพร้อมกับสร้างรายได้ออนไลน์ไปพร้อมกัน</p>
                    </div>
                    <div class="card">
                        <h1>พื้นที่สำหรับคนมีความฝันพร้อมสร้างผลงานสุดเจ๋ง!</h1>

                        <p class="mb">บน TAIKIP คุณสามารถเป็นครีเอเตอร์อิสระได้อย่างเต็มตัว พูดคุยกับแฟนคลับแบบเรียลไทม์ สร้างคอมมูนิตี้ของคุณเอง และแชร์ผลงานได้ทุกที่ทุกเวลา ตั้งราคาคลิปวิดีโอได้เอง หรือเปิดเป็นสาธารณะให้แฟนคลับรับชม สร้างฐานผู้ติดตาม เพิ่มรายได้จากยอดวิว แสดงความเป็นตัวคุณได้อย่างอิสระ 100%</p>

                        <p class="green">Shoot Your Video!! l Show You, Show Me! l</p>
                    </div>
                    <div class="card">
                        <h1>ฟังก์ชันเด่นของ TAIKIP</h1>

                        <ul>
                            <li>สร้างรายได้ง่าย ๆ เพียงอัปโหลดคลิปวิดีโอของคุณ</li>
                            <li>ระบบตรวจสอบธุรกรรมปลอดภัย รองรับการชำระเงินหลาย ช่องทาง</li>
                            <li>รายได้เข้าบัญชีรวดเร็ว สะดวก มั่นใจ ได้เงินจริง</li>
                            <li>แชทพูดคุยกับแฟนคลับ สร้างความสัมพันธ์ใกล้ชิดแบบเรียลไทม์</li>
                        </ul>
                    </div>
                    <div class="card">
                        <h1>TAIKIP เหมาะกับใคร?</h1>

                        <ul class="mb">
                            <li>คนที่ชอบ ถ่ายคลิปวิดีโอ สร้างคอนเทนต์ และทำ Vlog</li>
                            <li>คุณครูหรือเทรนเนอร์ออนไลน์ ที่ต้องการอัปโหลดคลิปสอน</li>
                            <li>เจ้าของแบรนด์ที่อยากให้แบรนด์เป็นที่รู้จักมากขึ้น</li>
                            <li>ครีเอเตอร์หน้าใหม่ ที่อยากเริ่มต้นสร้างตัวตนในโลกออนไลน์</li>
                        </ul>

                        <router-link to="">สมัครตอนนี้ ฟรี ไม่มีค่าใช้จ่าย</router-link>
                    </div>
                    <div class="card">
                        <h1>TAIKIP เหมาะกับใคร?</h1>
                        
                        <p class="mb">หากพบปัญหาหรือมีข้อสงสัย ทีมงาน TAIKIP พร้อมให้บริการและตอบกลับโดยเร็วที่สุด</p>

                        <router-link to="/contact-us"><img src="" alt="">Contact Us</router-link>
                    </div>
                </div>
            </section>
            <AppFooter />
        </main>
    </div>
</template>

<script setup>
import HeaderBar from '../components/HeaderBar.vue'
import AppFooter from '../components/AppFooter.vue'

</script>