<template>
    <div class="page">
        <HeaderBar />
        <main class="content">
            <div class="page-cover">
                <img src="/Image/00_Main Image/seductive-woman-sitting-by-window.webp" alt="">
                <div class="page-main">
                    <h1>
                        <img src="/Logo&Icon/Logo/Logo_green.webp" alt="">
                    </h1>
                    <p>คำถามที่พบบ่อย?</p>
                    <div class="main-bg"></div>
                </div>
            </div>
            <section class="faq-page">
                <!-- 先跑群組：User / Creator -->
                <div v-for="(group, groupName) in faqs" :key="groupName" :class="['faq-group', groupName.toLowerCase() + '-faq']">
                    <!-- 區塊標題 -->
                    <div class="faq-header">
                        <span class="user-icon"></span>
                        <span class="title">{{ groupName }}</span>
                    </div>

                    <!-- FAQ 列表 -->
                    <div v-for="(item, index) in group" :key="item.id" class="faq-item">
                        <!-- 問題列 -->
                        <button class="faq-question" @click="toggle(groupName, index)">
                            <span class="text">{{ item.question }}</span>

                            <span class="icon" :class="{ open: item.open }">
                                <img
                                    :src="
                                    groupName === 'user'
                                        ? '/Logo&Icon/Logo/Icon_go_green.webp'
                                        : '/Logo&Icon/Logo/Icon_go_blue.webp'
                                    "
                                    alt=""
                                />
                            </span>
                        </button>

                        <!-- 答案列 -->
                        <div v-if="item.open" class="faq-answer">
                            <ul>
                                <li v-for="(line, index) in item.answer" :key="index">{{ line }}</li>
                            </ul>
                        </div>
                    </div>
                </div>
            </section>
            <AppFooter />
        </main>
    </div>
</template>


<script setup>
import HeaderBar from '../components/HeaderBar.vue'
import AppFooter from '../components/AppFooter.vue'
import { reactive } from 'vue'

const faqs = reactive({
    user: [
        {
            id: 1,
            question: 'ถ้าหากคลิปวิดีโอที่ทำการซื้อไปแล้ว ถูกลบออกโดยครีเอเตอร์ควรทำ อย่างไร?',
            answer:[
                'ถ้าหากคลิปวิดีโอที่คุณทำการซื้อไปแล้ว ถูกลบออกโดยครีเอเตอร์ คลิปวิดีโอดังกล่าวจะยังคงถูกเก็บไว้ในรายการซื้อของคุณ คุณสามารถรับคลิปวิดีโอดังกล่าวได้ตลอด แต่ถ้าถ้าหากครีเอเตอร์ได้ทำการลบคลิปวิดีโอที่คุณยังไม่ได้ทำการซื้อไว้ คุณจะไม่สามารถรับคลิปวิดีโอนั้นได้อีก ยกเว้นคลิปวิดีโอที่ได้ทำการละเมิดข้อตกลงของเว็บไซต์อย่างรุนแรง คลิปวิดีโอนั้นจะถูกลบออกจากแพลตฟอร์มโดนทันทีและไม่สามารถดูได้อีก',
                ],
            open: false,
        },
        {
            id: 2,
            question: 'ถ้าหากไม่สามารถเข้าสู่ระบบได้ควรทำ อย่างไร?',
            answer:[
                'ล้างประวัติ แคช และคุกกี้จากเว็บเบราว์เซอร์ที่คุณใช้งานบนโทรศัพท์หรือคอมพิวเตอร์ของคุณ',
                'ทำการตรวจสอบการล็อกอินเข้าสู่ระบบของคุณทั้งบนโทรศัพท์และคอมพิวเตอร์ หากทั้งสองอุปกรณ์เข้าระบบไม่สำเร็จ ทำการกดปุ่ม “ลืมรหัสผ่าน” ที่หน้าล็อกอินเข้าสู่ระบบ หลังจากนั้นให้ทำการตั้งค่ารหัสผ่านใหม่เพื่อใช้ในการเข้าสู่ระบบในครั้งต่อไป',
                'หากวิธีแก้ปัญหาข้างต้นยังไม่สำเร็จ คุณสามารถติดต่อฝ่ายบริการลูกค้า เพื่อขอความช่วยเหลือเพิ่มเติม'
            ],
            open: false,
        },
        {
            id: 3,
            question: 'หากลืมรหัสผ่านควรทำอย่างไร?',
            answer:[
                'ทำการกดปุ่ม “ลืมรหัสผ่าน” ที่หน้าล็อกอินเข้าสู่ระบบ หลังจากนั้นให้ทำการตั้งค่ารหัสผ่านใหม่เพื่อใช้ในการเข้าสู่ระบบในครั้งต่อไป'
            ],
            open: false,
        },
        {
            id: 4,
            question: 'ซื้อคลิปวิดีโออย่างไร?',
            answer:[
                'บนเว็บไซต์ TAIKIP ใช้เพชรในการซื้อ - ขายคลิปวิดีโอ ก่อนที่ท่านจะซื้อคลิปวิดีโอของครีเอเตอร์ จำเป็นต้องทำการแลกเปลี่ยนเงินจริงเป็นเพชร เพื่อทำการซื้อคลิปวิดีโอที่ท่านต้องการรับชม'
            ],
            open: false,
        },
        {
            id: 5,
            question: 'การคืนเงิน',
            answer:[
                'คลิปวิดีโอที่ท่านได้ทำการซื้อไปแล้วจะไม่สามรถทำการขอคืนเงินเงินได้ อย่างไรก็ตามหากมีข้อกำหนดพิเศษภายใต้กฎหมายและระเบียบข้อบังคับในประเทศของคุณจึงจะสามารถยื่นขอคืนเงินกับทางแพลตฟอร์มนี้ได้ แต่ถ้าหากคลิปวิดีโอที่ต้องการขอเงินได้ถูกเปิดดูเป็นที่เรียบร้อยแล้วจะไม่สามารถยื่นคำขอคืนเงินกับทางเว็บไซต์ได้และหลังจากที่ได้รับการคืนเงินสำเร็จแล้วจะไม่สามารถเข้าดูคลิปวิดีโอนั้นๆได้อีก แต่ถ้าหากคุณได้ทำการซื้อเพชรแล้วไม่ได้ใช้ คุณสามรถทำการยืรนคำร้องขอคืนเงินกับทางเว็บไวต์ได้ภายใน 7 วันหลังจากซื้อเพชร'
            ],
            open: false,
        },
    ],
    creator: [
        {
            id: 1,
            question: 'สมัครครีเอเตอร์ทำอย่างไร?',
            answer:[
                'หลังจากที่ทำการสมัครสมาชิกหรือล็อกอินเข้าสู่ระบบสำเร็จแล้ว ทำการคลิกที่รูปโปรไฟล์ทางด้านขวาของเว็บไซต์ หลังจากนั้นให้คลิกที่ “สมัครครีเอเตอร์” และทำการกรอกแบบฟอร์มตามที่เว็บไซต์กำหนด หรือทำการคลิกปุ่ม “สมัครครีเอเตอร์” ที่แสดงในหน้าแรกของเว็บไซต์'
            ],
            open: false,
        },
        {
            id: 2,
            question: 'ข้อดีของการเป็นครีเอเตอร์',
            answer:[
                'คุณสามารถสร้างรายได้จากการเผยแพร่คลิปวิดีโอและคอนเทนต์สุดเจ๋ง ผ่านแพลตฟอร์ม TAIKIP อีกทั้งยังสามารถช่วยให้ครีเอเตอร์กับแฟนคลับสามารถติดต่อกันได้ง่ายขึ้น'
            ],
            open: false,
        },
        {
            id: 3,
            question: 'ค่าธรรมเนียมบนเว็บไซต์',
            answer:[
                'ทุกครั้งที่มีผู้ใช้งานทำการซื้อคลิปวิดีโอของครีเอเตอร์ ทางแพลตฟอร์ม TAIKIP จะเก็บค่าธรรมเนียมตามที่เงื่อนไขที่กำหนดไว้ ครีเอเตอร์จะถูกเก็บค่าธรรมเนียม 20% ยกตัวอย่างเช่น คลิปวิดีโอ 100 บาท จะจ่ายค่าธรรมเนียมให้ TAIKIP 20% หรือเท่ากับ 20 บาท ส่วนทางครีเอเตอร์จะได้รับเงินทั้งหมด 80 บาท'
            ],
            open: false,
        },
        {
            id: 4,
            question: 'อัปโหลดคลิปวิดีโออย่างไร?',
            answer:[
                'ในการอัปโหลดคลิปวิดีโอนั้น จะต้องคลิกที่ปุ่ม “อัปโหลด” ก่อนทำการอัปโหลด กรุณาอ่านกฎกติกาก่อนการอัปโหลดคลิปวิดีโอของเว็บไซต์ให้ละเอียด มิฉะนั้นอาจจะส่งผลต่อการอนุมัติคลิปวิดีโอ'
            ],
            open: false,
        },
        {
            id: 5,
            question: 'ทำไมคลิปวิดีโอถึงไม่ผ่านการอนุมัติ หรืออัปโหลดไม่สำเร็จ?',
            answer:[
                'ถ้าหากคลิปวิดีโอของท่านไม่ผ่านการอนุมัติ หรือทำการอัปโหลดไม่สำเร็จ โปรดทำการตรวจสอบให้ละเอียดว่าได้ทำการอัปโหลดคลิปวิดีโอตามกฎกติกาที่กำหนดไว้หรือไม่ หากทำการละเมิดกฎทางเว็บไซต์จะไม่สามารถทำการอนุมัติคลิปวิดีโอใดๆของท่านได้'
            ],
            open: false,
        },
        {
            id: 6,
            question: 'ถ้าหากไม่สามารถเข้าสู่ระบบหรือบัญชี ผู้ใช้ครีเอเตอร์ได้ควรทำอย่างไร?',
            answer:[
                'ล้างประวัติ แคช และคุกกี้จากเว็บเบราว์เซอร์ที่คุณใช้งานบนโทรศัพท์หรือคอมพิวเตอร์ของคุณ',
                'ทำการตรวจสอบการล็อกอินเข้าสู่ระบบของคุณทั้งบนโทรศัพท์และคอมพิวเตอร์ หากทั้งสองอุปกรณ์เข้าระบบไม่สำเร็จ ทำการกดปุ่ม “ลืมรหัสผ่าน” ที่หน้าล็อกอินเข้าสู่ระบบ หลังจากนั้นให้ทำการตั้งค่ารหัสผ่านใหม่เพื่อใช้ในการเข้าสู่ระบบในครั้งต่อไป',
                'หากวิธีแก้ปัญหาข้างต้นยังไม่สำเร็จ คุณสามารถติดต่อฝ่ายบริการลูกค้า เพื่อขอความช่วยเหลือเพิ่มเติม'
            ],
            open: false,
        },
        {
            id: 7,
            question: 'การปรับราคาคลิปวิดีโอของครีเอเตอร์',
            answer:[
                'ครีเอเตอร์สามารถทำการปรับขึ้นหรือลดราคาของคลิปวิดีโอของตนเองได้ตามใจชอบ การปรับราคาของคลิปวิดีโอนั้นจะไม่ส่งกระทบต่อผู้ใช้ที่ซื้อคลิปวิดีโอไปก่อนหน้านี้ แต่จะส่งผลต่อผู้ใช้ที่ซื้อคลิปวิดีโอภายหลังการปรับราคาเท่านั้น'
            ],
            open: false,
        },
        {
            id: 8,
            question: 'คลิปวิดีโอที่ทำการอัปโหลดแล้ว สามารถลบได้หรือไม่?',
            answer:[
                'ถ้าหากคลิปวิดีโอที่อัปโหลดผ่านการอนุมัติแล้ว จะไม่สามารถทำการลบคลิปวิดีโอออกจากเว็บไซต์ได้ แต่ท่านสามารถทำเลือกจัดการคลิปวิดีโอ แล้วทำการแก้ไขและกดเปลี่ยนแปลงสถานะของคลิปวิดีโอเป็น “ยืนยันแล้ว” คลิปวิดีโอที่ท่านที่การเปลี่ยนแปลงสถานะแล้วจะไม่แสดงขึ้นบนหน้าเว็บไซต์อีก เว้นแต่คลิปวิดีโอของท่านจะละเมิดกฎระเบียบของแพลตฟอร์มอย่างร้ายแรง คลิปวิดีโอนั้นจะถูกลบโดยแพลตฟอร์มแบบอัตโนมัติ'
            ],
            open: false,
        },
    ],
})

// 需要知道是哪一組（User / Creator）、第幾個 index
const toggle = (groupName, index) => {
    faqs[groupName][index].open = !faqs[groupName][index].open
}
</script>

