<template>
    <div class="page">
        <HeaderBar />
        <main class="content">
            <section class="legal-notice-page">

                <div class="card">
                    <h1>เกี่ยวกับ TAIKIP</h1>

                    <p class="mb">TAIKIP เป็นแอพพลิเคชั่นที่ต้องชำระเงินเพื่อการรับชม ผู้ใช้งาน สามารถสร้างรายได้ด้วยการสร้างบัญชี โพสต์ภาพถ่ายและคลิป วิดิโอส่วนตัว</p>

                    <p>ข้อกำหนดในการให้บริการเหล่านี้ รวมถึงนโยบายความเป็น ส่วนตัวของเรา (จะเรียกแทนด้วย "ข้อกำหนด") เป็นข้อปฏิบัติ ในการใช้บริการ TAIKIP หากท่านต้องการเข้าร่วมกับ TAIKIP ท่านจำเป็นต้องยืนยันว่าท่านยอมรับเงื่อนไขเหล่านี้ และตกลง ที่จะปฏิบัติข้อกำหนดดังกล่าว การที่ท่านเข้าถึงและใช้บริการของ เรายังอยู่ภายใต้บังคับของนโยบายความเป็นส่วนตัวและแนว ปฏิบัติชุมชนของเรา</p>
                    <p class="mb">เมื่อท่านใช้บริการ TAIKIP เราจะติดต่อสื่อสารกับท่านผ่านทาง อีเมล ซึ่งจะมีการแจ้งเตือนข่าวสารต่างๆให้ท่านเข้าใจและตกลง ตามเงื่อนไขการแจ้งเตือนประกาศและแบบฟอร์มอิเล็กทรอนิกส์ อื่นๆที่เราจัดเตรียมให้ท่านนั้นเป็นไปตามข้อกำหนดทางกฎหมาย</p>

                    <p class="mb">ท่านยินยอม และเข้าใจว่ามีค่าใช้จ่ายอินเตอร์เน็ตในขณะที่ใช้บริการ TAIKIP ซึ่งค่าใช้จ่ายทั้งหมดนี้ท่านจะเป็นผู้รับผิดชอบเองทั้งหมด</p>

                    <p class="main-text">ทางเราขอสงวนสิทธิ์ไม่แจ้งให้ท่านทราบล่วงหน้า หากมีการเปลี่ยนแปลงใด ๆ ดังต่อไปนี้:</p>
                    <ol>
                        <li>แก้ไข ระงับ หรือยุติ TAIKIP หรือฟังก์ชันใด ๆ ก็ตามของ TAIKIP</li>
                        <li>จำกัด ระงับ หรือยุติ การใช้บริการของท่านบน TAIKIP หรือฟังก์ชันใด ๆ ก็ตามของ TAIKIP</li>
                        <li>ลบ บล็อก หรือปิดกั้นการมองเห็นเนื้อหาที่ท่านทำการโพสต์ ลงใน TAIKIP</li>
                        <li>ตรวจสอบการใช้บริการ TAIKIP ของท่านเพื่อให้สอดคล้อง กับข้อกำหนด และกฎหมายที่บังคับใช้ (รวมถึงเนื้อหาหรือ ข้อมูลใด ๆ ที่ท่านโพสต์หรือส่งบน TAIKIP)</li>
                        <li>ตรวจสอบการใช้บริการ TAIKIP ที่น่าสงสัยหรือมีการใช้ บริการบน TAIKIP อย่างผิดกฎหมาย และให้ความร่วมมือ กับการบังคับใช้กฎหมายในการสอบสวน</li>
                    </ol>

                </div>

                <div class="card">
                    <h1>การใช้บริการ TAIKIP</h1>

                    <p class="mb">ผู้ติดตามของท่านสามารถเห็นรูปภาพ หรือคลิปวิดีโอที่ท่านสร้าง และโพสต์ลงบน TAIKIP อีกทั้งท่านยังสามารถติดตาม หรือเข้า ถึงรูปภาพ และคลิปวิดีโอของผู้ใช้บริการ TAIKIP ท่านอื่น ๆ ได้ ในขณะเดียวกันเมื่อท่านทำการอัปโหลดรูปภาพ หรือคลิปวิดิโอ ข้อมูลต่าง ๆ ของท่านจะถูกบันทึกไว้ในระบบ และไม่สามารถแชร์ ออกไปในแพลตฟอร์มอื่น ๆ นอกจาก TAIKIP ได้</p>

                    <p class="mb">เมื่อผู้ใช้อัปโหลดรูปภาพ หรือคลิปวิดีโอ (เรียกแทนด้วย "เนื้อหา") ใน TAIKIP ผู้สร้างสรรค์ผลงาน (เรียกแทนด้วย "ผู้สร้าง") โดย สามารถอนุญาตให้ผู้ติดตามของท่าน (เรียกแทนด้วย"ผู้ติดตาม") รับชมเนื้อหาแบบชำระเงินหรือแบบไม่ชำระเงิน (เรียกแทนด้วย "เนื้อหาฟรี" และ "เนื้อหาที่ต้องชำระเงิน") สำหรับเนื้อหาที่ต้อง ชำระเงิน ผู้สร้างจะกำหนดราคา (จำนวนเพชร) ตามค่าตอบแทน ที่ท่านคาดหวัง และTAIKIP จะเรียกเก็บค่าบริการแพลตฟอร์ม ส่วนหนึ่งจากเนื้อหาดังกล่าว ผู้ติดตามต้องกดซื้อในราคาที่ ผู้สร้างกำหนด (จำนวนเพชรที่ผู้สร้างกำหนด) บน app หลังจาก ชำระเงินเสร็จสิ้นจึงจะสามารถรับชมเนื้อหาได้</p>

                    <p class="main-text">ท่านสามารถตรวจสอบยอดเพชรคงเหลือของท่านได้ที่ หน้าโปรไฟล์ของท่าน (เรียกแทนด้วย "ยอดคงเหลือ") ยอดคงเหลือของท่านบนTAIKIP ประกอบไปด้วย:</p>
                    <ol class="mb">
                        <li>คะแนน TAIKIP ที่คุณได้ทำการซื้อ/ฝากเข้า แต่ยังไม่ได้ใช้ กับเนื้อหาที่ต้องชำระเงินจากผู้สร้างรายอื่น</li>
                        <li>คะแนน TAIKIP ที่ผู้ติดตามคนอื่นจ่ายให้คุณเมื่อพวกเขา ต้องการดูเนื้อหาแบบชำระเงินของคุณและคะแนน TAIKIP ที่ผู้ติดตามคนอื่นให้คุณมา (เรียกแทนด้วย "รายได้")</li>
                    </ol>
                    
                    <p class="main-text">คำชี้แจง:</p>
                    <ol>
                        <li>TAIKIP มิได้เป็นเจ้าของ หรือควบคุมเนื้อหาของผู้ใช้บริการ บน TAIKIP เนื้อหาของผู้ใช้บริการทั้งหมดที่ซื้อ-ขาย และ ตอบโต้บน TAIKIP นั้นจะจำกัดเฉพาะผู้สร้างและผู้ติดตาม ของเขาเท่านั้น หาก TAIKIP ได้ลบเนื้อหาใด ๆ ของท่านโดย ไม่มีการแจ้งให้ทราบล่วงหน้า ทั้งนี้เป็นไปตามข้อบังคับทาง กฎหมาย หรือจากการแจ้งจากบุคคลใด ๆ ที่เกี่ยวข้องกับ เนื้อหา ผู้ใช้บริการจะไม่สามารถคัดค้านได้ทุกกรณี</li>
                        <li>หากผู้สร้างจัดกิจกรรมส่วนตัวต่าง ๆ ผ่านทางแพลตฟอร์ม TAIKIP เนื้อหารายละเอียดจะไม่เกี่ยวข้องกับทาง TAIKIP โดยสิ้นเชิง และทางเราจะไม่ขอรับผิดชอบค่าชดเชย หรือคืน เงินให้ทุกกรณี</li>
                    </ol>
                    
                </div>

                <div class="card">
                    <h1>กลุ่มเป้าหมายผู้ใช้บริการ TAIKIP</h1>

                    <p class="mb">ผู้ติดตามของท่านสามารถเห็นรูปภาพ หรือคลิปวิดีโอที่ท่านสร้าง และโพสต์ลงบน TAIKIP อีกทั้งท่านยังสามารถติดตาม หรือเข้า ถึงรูปภาพ และคลิปวิดีโอของผู้ใช้บริการ TAIKIP ท่านอื่น ๆ ได้ ในขณะเดียวกันเมื่อท่านทำการอัปโหลดรูปภาพ หรือคลิปวิดิโอ ข้อมูลต่าง ๆ ของท่านจะถูกบันทึกไว้ในระบบ และไม่สามารถแชร์ ออกไปในแพลตฟอร์มอื่น ๆ นอกจาก TAIKIP ได้</p>

                    <p class="main-text">เมื่อท่านเริ่มใช้บริการ TAIKIP นั่นหมายความว่าท่าน ได้รับทราบ และยอมรับแล้วว่าในแพลตฟอร์มนี้มีเนื้อหา สำหรับผู้ใหญ่และยืนยันว่า:</p>
                    <ol>
                        <li>ท่านมีอายุไม่ต่ำกว่า 18 ปี</li>
                        <li>ท่านจะปฏิบัติตามข้อกำหนดของเราโดยไม่มีข้อโต้แย้งใด ๆ</li>
                        <li>ท่านยินยอม และพร้อมรับผิดชอบทุกสิ่งที่อาจจะเกิดขึ้นบน TAIKIP ในทุก ๆ อุปกรณ์ที่ใช้ไม่ว่าท่านจะเป็นเจ้าของอุปกรณ์ นั้น ๆ หรือไม่ก็ตาม</li>
                        <li>ท่านยินยอม และพร้อมที่จะรับผิดชอบเนื้อหาต่าง ๆ ที่ท่าน สร้างขึ้นหรืออัปโหลดลงบนแพลตฟอร์ม</li>
                        <li>ท่านจะไม่ละเมิดข้อกำหนด และข้อกฎหมายที่บังคับใช้เหล่านี้ ทุกกรณี</li>
                    </ol>

                </div>
                
                <div class="card">
                    <h1>การลงทะเบียนบัญชี</h1>

                    <p class="mb">ท่านต้องลงทะเบียนบัญชีเพื่อเข้าใช้ TAIKIP เมื่อลงทะเบียน ท่านต้องกรอกอีเมล ชื่อผู้ใช้ และรหัสผ่านที่ถูกต้อง ท่านต้อง สร้างโปรไฟล์ TAIKIP และใส่ข้อมูลเกี่ยวกับตัวท่านเพื่อทำให้ โปรไฟล์ TAIKIP ของท่านดูครบถ้วนสมบูรณ์ โปรดทราบไว้ก่อน ว่าในระหว่างที่สร้างบัญชีอาจต้องดำเนินขั้นตอนการยืนยันตัวตน</p>

                    <p class="main-text">ก่อนลงทะเบียน TAIKIP ท่านยืนยันว่า:</p>
                    <ol class="mb">
                        <li>ข้อมูลส่วนบุคคล และเนื้อหาทั้งหมด (รวมถึงเนื้อหาที่นำมา จากโซเชียลมีเดีย) สามารถอัปโหลดโดยบัญชีของท่าน</li>
                        <li>ท่านไม่เคยลงทะเบียน หรือมีบัญชี TAIKIP (รวมถึงการ ลงทะเบียนผ่านอีเมล ชื่อผู้ใช้ หรือหมายเลขโทรศัพท์อื่น ๆ)</li>
                        <li>หากท่านเคยมีบัญชี TAIKIP มาก่อน บัญชีเก่าของท่่านยัง ไม่ถูกระงับ หรือยุติการใช้งานนอกจากจะละเมิดข้อกำหนด ของเว็บไซต์เหล่านี้</li>
                        <li>บัญชีที่ท่านลงทะเบียนกับ TAIKIP เป็นบัญชีส่วนบุคคล และถูกกฎหมาย ท่านจะไม่ขาย ให้เช่า ให้ยืม หรือโอนบัญชี ของท่านไปยังบุคคลอื่นโดยไม่ได้รับอนุญาต</li>
                        <li>ท่านจะไม่ให้บุคคลที่สามที่ไม่ได้รับการอนุญาตเข้าสู่ระบบ TAIKIP ผ่านแอปพลิเคชัน</li>
                    </ol>
                    
                    <p>เมื่อท่านยืนยันเจตจำนงค์ที่จะเข้าร่วมกับ TAIKIP แล้ว นั่น หมายความว่าท่านยินยอมที่จะรับผิดชอบในการกระทำทั้งหมดที่ เกิดขึ้นในบัญชีของท่านอีกทั้งท่านยังมีหน้าที่รับผิดชอบในการ รักษาความปลอดภัยในการเข้าใช้บริการ ความเป็นส่วนตัว และ ข้อมูลส่วนบุคคลของท่าน หากมีบุคคลอื่นที่พยายามเข้าใช้งาน ด้วยบัญชีของท่าน โดยปราศจากการอนุญาตจากเจ้าของบัญชี ท่านควรแจ้งให้ทางเราทราบในทันที</p>

                </div>
                
                <div class="card">
                    <h1>การสั่งซื้อในแอพพลิเคชั่น</h1>

                    <p class="mb">หากต้องการรับชมเนื้อหาที่ต้องชำระเงินของผู้ใช้บริการท่านอื่น ๆ ท่านจำเป็นต้องซื้อ และชำระเงินที่ผู้เผยแพร่ได้กำหนดไว้ใน TAIKIP ในแอปพลิเคชั่น ซึ่งอาจมีการเรียกเก็บภาษีตามอัตรา ค่าธรรมเนียมที่กำหนด (สำหรับรายละเอียดข้อกำหนด และ นโยบายสามารถตรวจสอบได้จากแอปพลิเคชันที่ท่านใช้)</p>
                    <p class="main-text">คำชี้แจงสำคัญ:</p>
                    <p>การซื้อเพชรในแอปพลิเคชันจะไม่สามารถเรียกคืนเงินได้ ท่านยืนยันว่าเข้าใจ และยอมรับว่าเพชรที่คุณซื้อบนแอปพลิเคชัน TAIKIP เพื่อนำไปใช้ซื้อเนื้อหาที่ต้องชำระเงิน ซึ่งไม่ว่าจะเป็น ผู้สร้างเนื้อหาที่ได้จัดทำเนื้อหาที่ต้องชำระเงินขึ้นมา ทางเราเอง ไม่มีส่วนรับผิดชอบที่จะคืนเงินให้ท่านไม่ว่ากรณีใด ๆ ก็ตาม ในกรณีที่แอปพลิเคชัน TAIKIP เกิดข้อผิดพลาดเป็นเหตุทำให้ ยอดคงเหลือในบัญชีท่านผิดปกติ ทางเราจะรับผิดชอบในส่วนนี้</p>

                </div>

                <div class="card">
                    <h1>ปิดการใช้งานบัญชี</h1>

                    <p class="main-text">ท่านปิดการใช้งานด้วยตนเอง:</p>
                    <p>หากท่านต้องการปิดการใช้งานบัญชี TAIKIP ของท่าน กรุณา ติดต่อฝ่ายบริการลูกค้า TAIKIP:</p>
                    <ol class="mb">
                        <li>เราจะทำการยุติบัญชีของท่านภายใน 30 วันทำการหลังจาก ที่ได้รับคำขอปิดการใช้งานของท่าน คำชี้แจงสำคัญ: เมื่อบัญชีของท่านถูกปิดการใช้งานแล้ว จำนวนเพชรที่เหลือ อยู่ในบัญชีของท่านจะถือเป็นโมฆะ</li>
                    </ol>
                    <p class="main-text">ถูกปิดการใช้งานโดยแอปพลิเคชัน:</p>
                    <p>ท่านตกลงและยอมรับว่าเราสามารถสงวนสิทธิ์ในการปิดใช้งาน บัญชีของท่านได้ตามข้อตกลงดังนี้:</p>
                    <ol>
                        <li>เในระหว่างการใช้บริการแอปพลิเคชัน TAIKIP คุณได้ละเมิด ข้อกำหนดหรือข้อกฎหมายที่ทางเราบังคับใช้ไม่ว่าข้อใด ข้อหนึ่ง บัญชีของท่านจะถูกปิดทันที</li>
                    </ol>

                </div>
                
                <div class="card">
                    <h1>พฤติกรรมต้องห้าม</h1>

                    <p class="main-text">เราขอความร่วมมือจากผู้ใช้บริการ TAIKIP ทุกท่าน ขอให้ทุกท่านปฏิบัติตามข้อกำหนดและข้อตกลงของเราอย่างเคร่งครัดตลอดการใช้บริการ TAIKIP ระหว่าง ที่ท่านกำลังใช้บริการ TAIKIP ห้ามกระทำดังต่อไปนี้:</p>
                    <ol class="mb">
                        <li>ปลอมแปลงข้อมูลบัญชี หรือใช้ข้อมูลของบุคคลอื่นโดยไม่ได้ รับอนุญาต</li>
                        <li>กระทำสิ่งผิดกฎหมายผ่านวิธีการต่าง ๆ เพื่อจุดประสงค์ใดๆ ก็ตาม รวมถึงการละเมิดสิทธิส่วนบุคคลหรือข้อกฎหมายที่ บังคับใช้</li>
                        <li>สร้างเนื้อหา อัปโหลด โพสต์ แสดง หรือเผยแพร่เนื้อหาของ ผู้ใช้โดยละเมิดลิขสิทธิ์ เครื่องหมายการค้า ความเป็นส่วนตัว หรือ ทรัพย์สินอื่น ๆ รวมถึงสิทธิส่วนบุคคลของผู้อื่น (เช่น การใช้ชื่อ ภาพถ่ายส่วนตัว รูปภาพ และข้อมูลประจำตัวของ บุคคลอื่นโดยที่ไม่ได้รับการอนุญาต) สร้างเนื้อหา คัดลอก ทำซ้ำ เผยแพร่ หรือแก้ไขเนื้อหาใด ๆ ที่ไม่ใช่ของคุณ หรือ ไม่ได้รับการอนุญาตจากเจ้าของเนื้อหา (รวมถึงการถ่ายภาพ หรือถ่ายภาพหน้าจอเป็นต้น) โดยไม่ได้รับอนุญาตเป็นลาย ลักษณ์อักษรอย่างชัดแจ้งจากเจ้าของเนื้อหา</li>
                        <li>มีการถอดรหัส วิศวกรรมย้อนกลับ หรือพยายามคัดลอกรหัส โปรแกรมต้นฉบับของ TAIKIP ด้วยวิธีอื่นๆ</li>
                        <li>คุกคามการทำงานของเซิร์ฟเวอร์ TAIKIP ซึ่งรวมถึงการ คุกคามระบบ การดำเนินของเว็บ แต่ไม่จำกัดการโจมตีของ แฮ็กเกอร์ การโจมตีด้วยสแปม ทำลายไฟร์วอลล์ กลไกการ เพิ่มรหัส ขั้นตอนการตรวจสอบความปลอดภัย หรือบัญชีอื่น พยายามเข้ามาดูข้อความของคุณโดยที่ยังไม่ได้การอนุญาต</li>
                        <li>ใช้โปรแกรม เครื่องมือ หรือโปรแกรมอัตโนมัติใดๆ (รวมถึง แต่ไม่จำกัดเพียงโปรแกรมรวบรวมข้อมูลเว็บ หุ่นยนต์ และสคริปต์อัตโนมัติ) เพื่อเข้าถึง TAIKIP หรือเซิร์ฟเวอร์ TAIKIP ที่เกี่ยวข้องเพื่อรวบรวมข้อมูลและเนื้อหาจาก TAIKIP</li>
                        <li>ใช้ TAIKIP ในการทำสิ่งที่ละเมิดข้อกำหนดเหล่านี้หรือข้อ กฎหมายที่บังคับใช้</li>
                    </ol>
                    
                    <p></p>ห้ามพฤติกรรมใด ๆ ที่นำไปสู่การซื้อขายบัญชีของทางผู้ใช้ TAIKIP ทั้งบัญชีเก่า และใหม่ (เช่น ไม่สนับสนุนให้ผู้ใช้ TAIKIP ที่มีบัญชีอยู่แล้วใช้บัญชีอื่นลงทะเบียนเพิ่มอีก เพื่อนำไปใช้ ในการเติมเงิน หรือแนะนำผู้ใช้ TAIKIP ที่มีอยู่ให้ใช้วิธีการยืนยัน ตัวตนอย่างไม่เป็นทางการบน TAIKIP ในการซื้อเพชร) ผู้ฝ่าฝืน หรือผู้ใช้ที่มีพฤติกรรมแบบนี้จะถูกระงับการใช้งาน และยุติบัญชี ทันที เพชรทั้งหมดในบัญชีจะถูกยึดคืนโดยไม่มีเงื่อนไข และต้อง ชดใช้ความเสียหายที่เกิดขึ้นทุกกรณี

                    <p class="main-text green">หากต้องการรายงานพฤติกรรมที่ไม่เหมาะสมของผู้ใช้บริการ TAIKIP ท่านอื่น ๆ โปรดติดต่อที่ฝ่ายบริการลูกค้า:</p>
                    <p class="main-text">ความรับผิดชอบในการละเมิด</p>
                    <ol>
                        <li>ผู้ใช้ TAIKIP ควรตรวจสอบให้แน่ใจว่าเนื้อหาทั้งหมดที่ อัปโหลดบน TAIKIP นั้นล้วนจัดทำขึ้นโดยผู้ใช้ TAIKIP ไม่มี การละเมิดสิทธิ์ และก้าวก่ายถึงเรื่องผลประโยชน์ของผู้ใด และไม่เคยถูกเผยแพร่ที่อื่นยกเว้นที่ TAIKIP</li>
                        <li>กรณีที่ถูกละเมิด ผู้ใช้ TAIKIP ควรรับผิดชอบต่อความ ปลอดภัยด้วยตนเอง</li>
                        <li>เมื่อได้รับการแจ้งเตือนจาก TAIKIP ผู้ใช้ TAIKIP ที่ได้ อัปโหลดเนื้อหาใด ๆ หรือเป็นเจ้าของเนื้อหาจะต้องรับผิดชอบ ต่อการอัปโหลดคลิปวิดิโอบน TAIKIP โดยไม่มีเงื่อนไขใด ๆ (รวมถึงไม่จำกัดเฉพาะบุคคลทั้งหมดที่ปรากฎในเนื้อหาที่ อัปโหลดจากผู้ใช้ TAIKIP) ควรได้รับการมอบอำนาจ ทำการ ชำระค่าใช้จ่ายที่เกี่ยวข้อง และต้องรับรองว่าได้ใช้สิทธิ์บน TAIKIP อย่างถูกกฎหมาย</li>
                        <li>เนื้อหาบน TAIKIP ที่อัปโหลดโดยผู้ใช้ TAIKIP เป็นพฤติกรรม ส่วนบุคคลของผู้ใช้ TAIKIP บริษัทจะไม่รับผิดชอบทาง กฎหมายสำหรับข้อพิพาททั้งหมดที่เกิดขึ้นทุกกรณี</li>
                    </ol>
                    
                </div>
            </section>
            <AppFooter />
        </main>
    </div>
</template>

<script setup>
import HeaderBar from '../components/HeaderBar.vue'
import AppFooter from '../components/AppFooter.vue'



</script>